[
    "{\"content\": \"bank_bank_13.nepal_bank_limited(nbl).about_us_chunk_1\", \"source\": \"could be raised out of floated capital of Rs.2.5 million). Raising deposit and mobilizing the collected deposit was even more difficult. Absence of any bank in Nepal was hampering the economic progress of the country. This was taken into consideration by Nepal Bank Limited with key focus on overcoming such economic hamper and difficulties of general public. This was initiated by providing banking services to people removing their inconvenience. This objective got better and bigger with the time. Nepal Bank Limited has so far adopted according to the technological changes, national economic welfare, customer preferences in services, market competition and global financial scenarios to become a leading, glorious and highly reputed bank of Nepal.\", \"score\": 0.8649508833885193, \"similarity\": 0.8070726990699768, \"rank\": 1}",
    "{\"content\": \"bank_bank_13.nepal_bank_limited(nbl).about_us_chunk_0\", \"source\": \"Nepal Bank Limited (NBL) , the first bank of Nepal proudly holds the glory of marking the formal beginning of banking system in Nepal. Nepal Bank Limited was established as FIRST bank of Nepal on Kartik 30, 1994 (November 15, 1937 A.D.) under Nepal Bank Act 1937. The bank was established with an authorized capital of Rs.10 million, issued capital of Rs.2.5 million and paid up capital of Rs.0.842 million. The share held by government and private sector was 60% and 40% respectively. Noteablly, Nepal Bank Limited was inaugurated by King Tribhuvan with supportive vision of Prime Minister Juddha Shumsher Jung Bahadur Rana to institutionalize formal banking system in Nepal. Before the establishment of NBL, all monetary transactions were carried out by private dealers and trading centers. It was the time when there was no trust for such formal banking system. This reflected in under subscription of shares (OnlyRs.0.842 million could be raised out of floated capital of Rs.2.5 million). Raising deposit and mobilizing the collected deposit was even more difficult. Absence of any bank in Nepal was hampering the economic progress of the country. This was taken into consideration by Nepal Bank Limited with key focus on overcoming such\", \"score\": 0.832529890537262, \"similarity\": 0.7607569694519043, \"rank\": 2}",
    "{\"content\": \"bank_bank_15.prime_commercial_bank_nepal(pcbn).bank_acronyms\", \"source\": \"PCBN\", \"score\": 0.6953499465600104, \"similarity\": 0.7554455995559692, \"rank\": 3}"
]